In [141]:
## Create a data frame with 4 columns 4 rows
import pandas as pd
k=[[1,2,3,4],[2,3,4,5],[4,5,6,7],[7,8,9,0]]
g=pd.DataFrame(k,columns=['k','l','m','n'],index=['a','b','c','d'])
print(g)

   k  l  m  n
a  1  2  3  4
b  2  3  4  5
c  4  5  6  7
d  7  8  9  0

In [142]:
##print all Columns form your data frame
g.columns

Index(['k', 'l', 'm', 'n'], dtype='object')

In [143]:
##print all rows from your data frame
g.loc[['a','b','c','d'],:]

   k  l  m  n
a  1  2  3  4
b  2  3  4  5
c  4  5  6  7
d  7  8  9  0

In [144]:
##print Second column in your data frame
g[["l"]]

   l
a  2
b  3
c  5
d  8

In [145]:
## print last 2 columns from your data Frame
g[["m","n"]]

   m  n
a  3  4
b  4  5
c  6  7
d  9  0

In [146]:
##print fourth row from your data Frame
g.loc[["d"]]

   k  l  m  n
d  7  8  9  0

In [147]:
##print first 2 Rows from your data Frame
g.loc["a":"b"]

   k  l  m  n
a  1  2  3  4
b  2  3  4  5

In [148]:
#print all rows and first 2 columns from your data Frame
g.loc["a":,"k":"l"]

   k  l
a  1  2
b  2  3
c  4  5
d  7  8

In [149]:
#Delete any row from your data Frame
g.drop("a")

   k  l  m  n
b  2  3  4  5
c  4  5  6  7
d  7  8  9  0

In [150]:
#Delete any column from your data Frame
g.pop("k")

a    1
b    2
c    4
d    7
Name: k, dtype: int64

In [151]:
g

   l  m  n
a  2  3  4
b  3  4  5
c  5  6  7
d  8  9  0

In [152]:
#3Add a column to a Data Frame
new=[1,2,3,4]
g["q"]=new
print(pd.DataFrame(g))

   l  m  n  q
a  2  3  4  1
b  3  4  5  2
c  5  6  7  3
d  8  9  0  4

In [153]:
#Add a Row to Data Frame
new={'l':2,'m':5,'n':8,'q':6}
q=pd.DataFrame(new,index=['f'])
g=pd.concat([q,g])
g

   l  m  n  q
f  2  5  8  6
a  2  3  4  1
b  3  4  5  2
c  5  6  7  3
d  8  9  0  4

In [115]:
##Iterate all Columns in your Data Frame and print result
for i in g.iteritems():
    print(i)

('k', a    1
b    2
c    4
d    7
Name: k, dtype: int64)
('l', a    2
b    3
c    5
d    8
Name: l, dtype: int64)
('q', a    1
b    2
c    3
d    4
Name: q, dtype: int64)

In [117]:
#Iterate the 3rd column values of your Data frame and print result.
for i in g.iteritems():
    print(i)

('k', a    1
b    2
c    4
d    7
Name: k, dtype: int64)
('l', a    2
b    3
c    5
d    8
Name: l, dtype: int64)
('q', a    1
b    2
c    3
d    4
Name: q, dtype: int64)

In [88]:
##Iterate all Rows in your Data Frame and print result.
for i in g.iterrows():
    print(i)

('a', k    1
l    2
q    1
Name: a, dtype: int64)
('b', k    2
l    3
q    2
Name: b, dtype: int64)
('c', k    4
l    5
q    3
Name: c, dtype: int64)
('d', k    7
l    8
q    4
Name: d, dtype: int64)

In [98]:
#Read income.csv file and print as Data Frame
import pandas as pd
file="income.csv"
f=pd.read_csv(file)
f

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [105]:
#delete 2006 column info from your data Frame by using drop
f.drop("2006",axis=1)

,GEOID,State,2005,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55734,57014,56134,54283,53367,57020,57528